// 1. без локального сховища 
// написати логіку додавання задачі по натисканню на кнопку едд
// 1.1 зчитати значення з поля вводу
// 1.2 робимо перевірку на пусту строку, якщо вона пуста повідомляємо кор та не дадаємо задачу
// 1.3 якщо задача є. то створюєсо пункт списку в який додаєсо текст задачі
// 1.4 додати хректик до пукту списку
// 1.5 очистити поле вводу

// 2. написат логіку стану задачі (виконана чи ні)
// 2.1 по настисканню на лішку тоглити клас чекд
// 
// 3. написати логіку видалення задачі зі списку
//  3.1. якщо натисли на хрестик - видаляємо лішку зі списку



// з локальним сховищем
// 1.будемо зберігати задачі в масиві обєктів
//  обєкт з полями: text, isDone, id.id- потрібно для пошуку ел., видалення 
// ел. та для оновлення статусу елементів. id-повинен бути 
// і у елементу і у елементу сховища

// 2.напишемо функції завантаження диних зі сховища та для зберігання 
// даних в схов. storage.js
// 3. коли ми додаємо лі на сторінку будемо додавати її у сторідж
// 4. написати логіку функції яка буде діставати дані зі стор. і
// додавати іх на сторінку у вигляді лішок
// 5. написати логіку для видалення таски зі стору та для оновлення 
// стану таски.



import { addNewTask,  handleTaskBehaviour,fillTasksList } from "./functions.js";

const addBtn = document.getElementById('addBtn');
const myUL = document.getElementById('myUL');

addBtn.addEventListener('click', addNewTask);
myUL.addEventListener('click', handleTaskBehaviour)
window.addEventListener("DOMContentLoaded", fillTasksList)


